doc/request_bodies/processxml_get_transactions_from_general_ledger_with_modified_since.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.twinfield.com/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://www.twinfield.com/" xmlns:s1="http://microsoft.com/wsdl/types/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><soap:Header><Header xmlns="http://www.twinfield.com/"><SessionID>session_id</SessionID></Header></soap:Header><soap:Body><ProcessXmlString xmlns="http://www.twinfield.com/"><xmlRequest><![CDATA[
                <columns code="000">
                  
              <column>
                  <field>fin.trs.head.yearperiod</field>
                  <label>Periode</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from>2025/08</from>
                  <to>2025/09</to>
                  <finderparam/>
              </column>
              <column>
                  <field>fin.trs.line.dim1</field>
                  <label>Grootboek</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from></from>
                  <to></to>
                  <finderparam/>
              </column>
              <column>
                  <field>fin.trs.line.dim2</field>
                  <label>Kostenplaats</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from></from>
                  <to></to>
                </column>
                <column>
                  <field>fin.trs.head.code</field>
                  <label>Dagboek</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>equal</operator>
                  <from/>
                  <to/>
                  <finderparam>hidden=1</finderparam>
                </column>
                <column>
                  <field>fin.trs.head.number</field>
                  <label>Boekst.nr.</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from/>
                  <to/>
                  <finderparam/>
                </column>
                <column>
                  <field>fin.trs.head.curcode</field>
                  <label>Valuta</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>none</operator>
                  <from/>
                  <to/>
                  <finderparam/>
                </column>
                <column>
                  <field>fin.trs.line.valuesigned</field>
                  <label>Bedrag</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from/>
                  <to/>
                  <finderparam/>
                </column>
                <column>
                  <field>fin.trs.head.status</field>
                  <label>Status</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>equal</operator>
                  <from>normal</from>
                  <to/>
                  <finderparam/>
                </column>
            
                <column>
                  <field>fin.trs.head.modified</field>
                  <label>Modification date</label>
                  <visible>true</visible>
                  <ask>true</ask>
                  <operator>between</operator>
                  <from>20240512110300</from>
                  <to>20250902230741</to>
                </column>
              
                </columns>
              ]]></xmlRequest></ProcessXmlString></soap:Body></soap:Envelope>