doc/request_bodies/processxml_get_sales_transactions.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.twinfield.com/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://www.twinfield.com/" xmlns:s1="http://microsoft.com/wsdl/types/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><soap:Header><Header xmlns="http://www.twinfield.com/"><SessionID>session_id</SessionID></Header></soap:Header><soap:Body><ProcessXmlString xmlns="http://www.twinfield.com/"><xmlRequest><![CDATA[
                <columns code="100">
                  
              <sort>
                 <field>fin.trs.head.code</field>
              </sort>
              <column>
                  <field>fin.trs.head.office</field>
                  <label>Office</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>equal</operator>
                  <from>company</from>
                  <to/>
                  <finderparam/>
              </column>
              <column>
                  <field>fin.trs.head.yearperiod</field>
                  <label>Periode</label>
                  <visible>true</visible>
                  <ask>false</ask>
                  <operator>between</operator>
                  <from>1995/01</from>
                  <to>2025/12</to>
                  <finderparam/>
              </column>
              <column>
                <field>fin.trs.head.shortname</field>
                <label>Naam</label>
                <visible>true</visible>
              </column>
              <column>
                <field>fin.trs.head.date</field>
                <label>Boekdatum</label>
                <visible>true</visible>
              </column>
              <column>
                 <field>fin.trs.head.curcode</field>
                 <label>currency</label>
                 <visible>true</visible>
              </column>
              <column>
                 <field>fin.trs.line.valuesigned</field>
                 <label>value</label>
                 <visible>true</visible>
              </column>
              <column>
                 <field>fin.trs.line.openvaluesigned</field>
                 <label>open_value</label>
                 <visible>true</visible>
              </column>
              <column>
                <field>fin.trs.line.availableforpayruns</field>
                <label>available_for_payruns</label>
                <visible>true</visible>
              </column>
              <column>
                <field>fin.trs.line.matchstatus</field>
                <label>status</label>
                <visible>true</visible>
              </column>
              <column>
                <field>fin.trs.line.dim2</field>
                <label>customer_code</label>
                <visible>true</visible>
                <from></from>
                <to></to>
                <operator>between</operator>
              </column>
            <column>
                  <field>fin.trs.head.code</field>
                  <label>Code</label>
                  <visible>true</visible>
                  <ask>true</ask>
                  <operator>equal</operator>
                  <from>VRK</from>
                  <to>VRK</to>

                  <finderparam>VRK</finderparam>
                </column>
              <column>
                 <field>fin.trs.line.invnumber</field>
                 <label>invoice_number</label>
                 <visible>true</visible>
              </column><column>
                  <field>fin.trs.head.number</field>
                  <label>Boekst.nr.</label>
                  <visible>true</visible>
                  <ask>true</ask>
                  <operator>between</operator>
                  <from>20210812</from>
                  <to>20210812</to>
                </column>
              
                </columns>
              ]]></xmlRequest></ProcessXmlString></soap:Body></soap:Envelope>